{"chapters":[
    {
    "chapter": "Event Emitters",
    "purpose": "This chapter aims to teach the basics and advanced concepts of using EventEmitter in Node.js.",
    "assignments": [
      {
        "Order": 1,
        "subtitle": "Basic EventEmitter",
        "description": "Create a simple EventEmitter instance and register a listener for a custom event.",
        "purpose": "To understand how to create an EventEmitter instance, register a listener, and emit an event."
      },
      {
        "Order": 2,
        "subtitle": "Removing Event Listeners",
        "description": "Learn to remove specific event listeners.",
        "purpose": "To practice adding and removing listeners and observe how only the remaining listeners are called when the event is emitted."
      },
      {
        "Order": 3,
        "subtitle": "One-time Event Listeners",
        "description": "Use the once method to register a one-time listener.",
        "purpose": "To ensure the one-time listener is only called once."
      },
      {
        "Order": 4,
        "subtitle": "Passing Arguments to Listeners",
        "description": "Pass arguments to the event listeners when emitting an event.",
        "purpose": "To understand how to pass arguments to listeners."
      },
      {
        "Order": 5,
        "subtitle": "Handling Errors",
        "description": "Handle errors using the 'error' event.",
        "purpose": "To learn how to handle errors in EventEmitter and ensure the application doesn't crash."
      },
      {
        "Order": 6,
        "subtitle": "Wildcard Event Listener (Advanced)",
        "description": "Implement a wildcard listener that listens to all events.",
        "purpose": "To understand how to extend EventEmitter functionality and handle multiple events with a single listener."
      },
      {
        "Order": 7,
        "subtitle": "Event Listener with Priority (Advanced)",
        "description": "Implement a priority system for event listeners.",
        "purpose": "To learn how to manage and execute listeners based on their priority."
      },
      {
        "Order": 8,
        "subtitle": "Event Emitter with Asynchronous Listeners",
        "description": "Handle asynchronous event listeners.",
        "purpose": "To understand how to manage asynchronous operations within event listeners."
      },
      {
        "Order": 9,
        "subtitle": "Custom Event Emitter Class",
        "description": "Extend the EventEmitter class to add custom functionality.",
        "purpose": "To learn how to extend EventEmitter and add custom methods."
      },
      {
        "Order": 10,
        "subtitle": "Real-World Use Case - File Processing",
        "description": "Use EventEmitter for a real-world scenario, such as processing a file.",
        "purpose": "To apply your knowledge of EventEmitter to a practical use case and see how it can be used to manage complex workflows."
      }
    ]
  },
  {
    "chapter": "Promises",
    "purpose": "This chapter aims to provide a comprehensive understanding of promises and asynchronous programming in JavaScript.",
    "assignments": [
      {
        "Order": 1,
        "subtitle": "Basic Promise Creation",
        "description": "Create a basic promise that resolves after 2 seconds with a message 'Hello, World!'.",
        "purpose": "To understand the basic creation and resolution of promises."
      },
      {
        "Order": 2,
        "subtitle": "Handling Promise Rejection",
        "description": "Create a promise that rejects with an error message 'Something went wrong!' and handle the rejection.",
        "purpose": "To learn how to handle promise rejections."
      },
      {
        "Order": 3,
        "subtitle": "Chaining Promises",
        "description": "Chain two promises, where the first one resolves with a number and the second one adds 10 to that number.",
        "purpose": "To practice chaining promises for sequential operations."
      },
      {
        "Order": 4,
        "subtitle": "Using Promise.all",
        "description": "Create three promises that resolve with different values after different intervals. Use Promise.all to wait for all of them to complete.",
        "purpose": "To understand how to use Promise.all to handle multiple promises."
      },
      {
        "Order": 5,
        "subtitle": "Using Promise.race",
        "description": "Create three promises that resolve after different intervals. Use Promise.race to get the result of the first promise that resolves.",
        "purpose": "To learn how to use Promise.race to handle the fastest promise."
      },
      {
        "Order": 6,
        "subtitle": "Promise in a Function",
        "description": "Create a function that returns a promise. The promise should resolve with the square of a number after 2 seconds.",
        "purpose": "To practice returning promises from functions."
      },
      {
        "Order": 7,
        "subtitle": "Error Handling in Promises",
        "description": "Create a promise that may either resolve or reject based on a condition. Handle both the success and error cases.",
        "purpose": "To understand how to handle errors in promise-based operations."
      },
      {
        "Order": 8,
        "subtitle": "Nested Promises",
        "description": "Create a promise that returns another promise. The inner promise should resolve with a value after 1 second, and the outer promise should resolve after the inner promise resolves.",
        "purpose": "To learn how to handle nested promises."
      },
      {
        "Order": 9,
        "subtitle": "Async/Await Syntax",
        "description": "Rewrite the previous assignment using async/await syntax.",
        "purpose": "To understand how to use async/await for handling asynchronous operations."
      },
      {
        "Order": 10,
        "subtitle": "Sequential Promise Execution",
        "description": "Create an array of numbers. Write a function that returns a promise to multiply each number by 2 after 1 second. Use reduce to execute these promises sequentially.",
        "purpose": "To learn how to execute promises sequentially using reduce."
      }
    ]
  },
  {
    "chapter": "Buffers",
    "purpose": "This chapter aims to teach the fundamentals of working with buffers in Node.js.",
    "assignments": [
      {
        "Order": 1,
        "subtitle": "Create a Buffer",
        "description": "Create a buffer of length 10 and fill it with zeros. Log the buffer to the console.",
        "purpose": "To understand how to create and initialize buffers."
      },
      {
        "Order": 2,
        "subtitle": "Write to a Buffer",
        "description": "Create a buffer of length 15. Write the string 'Hello' to the buffer starting at position 0. Log the buffer to the console.",
        "purpose": "To learn how to write data to buffers."
      },
      {
        "Order": 3,
        "subtitle": "Read from a Buffer",
        "description": "Create a buffer containing the string 'Node.js'. Read and log the first 4 bytes as a string.",
        "purpose": "To practice reading data from buffers."
      },
      {
        "Order": 4,
        "subtitle": "Copy Buffers",
        "description": "Create two buffers of length 10 each. Fill the first buffer with the string 'BufferOne'. Copy the contents of the first buffer into the second buffer. Log both buffers to the console.",
        "purpose": "To understand how to copy data between buffers."
      },
      {
        "Order": 5,
        "subtitle": "Concatenate Buffers",
        "description": "Create three buffers with the strings 'Node', '.', and 'js'. Concatenate these buffers into a single buffer. Log the resulting buffer as a string.",
        "purpose": "To learn how to concatenate multiple buffers."
      },
      {
        "Order": 6,
        "subtitle": "Convert Buffer to JSON",
        "description": "Create a buffer with the string 'Buffer to JSON'. Convert this buffer into a JSON object. Log the JSON object.",
        "purpose": "To understand how to convert buffers to JSON."
      },
      {
        "Order": 7,
        "subtitle": "Allocate Unsafe Buffer",
        "description": "Allocate an unsafe buffer of length 5. Fill it with the values [1, 2, 3, 4, 5]. Log the buffer to the console.",
        "purpose": "To learn how to allocate and use unsafe buffers."
      },
      {
        "Order": 8,
        "subtitle": "Compare Buffers",
        "description": "Create two buffers with the strings 'BufferA' and 'BufferB'. Compare the buffers using Buffer.compare(). Log the result of the comparison.",
        "purpose": "To practice comparing buffers."
      },
      {
        "Order": 9,
        "subtitle": "Slice a Buffer",
        "description": "Create a buffer with the string 'Node.js Buffers'. Slice the buffer to get the word 'Buffers'. Log the sliced buffer as a string.",
        "purpose": "To understand how to slice buffers."
      },
      {
        "Order": 10,
        "subtitle": "Encode and Decode Buffers",
        "description": "Create a buffer from a UTF-8 encoded string 'Encoding Buffers'. Convert this buffer to a base64 encoding. Decode the base64 encoded buffer back to a string. Log the final string.",
        "purpose": "To learn how to encode and decode buffers."
      }
    ]
  },
  {
    "chapter": "Streams and Piping",
    "purpose": "This chapter aims to teach the basics and advanced concepts of streams and piping in Node.js.",
    "assignments": [
      {
        "Order": 1,
        "subtitle": "Create a Readable Stream",
        "description": "Create a readable stream that emits numbers from 1 to 5. Log the data emitted by the stream.",
        "purpose": "To understand how to create and use readable streams."
      },
      {
        "Order": 2,
        "subtitle": "Create a Writable Stream",
        "description": "Create a writable stream that logs data written to it. Write the string 'Hello Stream' to the writable stream.",
        "purpose": "To learn how to create and use writable streams."
      },
      {
        "Order": 3,
        "subtitle": "Pipe Streams",
        "description": "Create a readable stream that emits 'Hello, World!'. Create a writable stream that logs data. Pipe the readable stream to the writable stream.",
        "purpose": "To practice piping data from a readable stream to a writable stream."
      },
      {
        "Order": 4,
        "subtitle": "Transform Stream",
        "description": "Create a transform stream that converts input text to uppercase. Pipe the string 'node.js streams' through this transform stream. Log the transformed output.",
        "purpose": "To understand how to create and use transform streams."
      },
      {
        "Order": 5,
        "subtitle": "Read from a File",
        "description": "Create a readable stream from a file named input.txt. Log the data read from the file.",
        "purpose": "To learn how to read data from a file using streams."
      },
      {
        "Order": 6,
        "subtitle": "Write to a File",
        "description": "Create a writable stream to a file named output.txt. Write the string 'Writing to a file using streams' to this writable stream.",
        "purpose": "To understand how to write data to a file using streams."
      },
      {
        "Order": 7,
        "subtitle": "Duplex Stream",
        "description": "Create a duplex stream that acts as both readable and writable. For every chunk written to it, it should respond with 'Echo: ' + chunk. Test the duplex stream by writing and reading data.",
        "purpose": "To learn how to create and use duplex streams."
      },
      {
        "Order": 8,
        "subtitle": "Pipe Multiple Streams",
        "description": "Create a readable stream from a file named input.txt. Create a transform stream that reverses the content. Create a writable stream to a file named output.txt. Pipe the readable stream through the transform stream and then to the writable stream.",
        "purpose": "To practice piping data through multiple streams."
      },
      {
        "Order": 9,
        "subtitle": "Handle Stream Errors",
        "description": "Create a readable stream from a non-existent file. Handle the error event to log an appropriate message.",
        "purpose": "To understand how to handle errors in streams."
      },
      {
        "Order": 10,
        "subtitle": "Stream Performance",
        "description": "Create a script to read a large file using a stream and measure the time taken. Compare the performance with reading the same file using fs.readFileSync.",
        "purpose": "To compare the performance of streams with traditional file reading methods."
      }
    ]
  },
  {
    "chapter": "fs (File System)",
    "purpose": "This chapter aims to familiarize users with basic file system operations using scripts.",
    "assignments": [
      {
        "Order": 1,
        "subtitle": "Reading a File",
        "description": "Create a script that reads the contents of a file named example.txt and logs it to the console.",
        "purpose": "To learn how to read files and output their content to the console."
      },
      {
        "Order": 2,
        "subtitle": "Writing to a File",
        "description": "Create a script that writes the string 'Hello, File System!' to a file named output.txt.",
        "purpose": "To understand how to write data to a file."
      },
      {
        "Order": 3,
        "subtitle": "Appending to a File",
        "description": "Create a script that appends the string 'Appended content' to the output.txt file.",
        "purpose": "To practice appending data to an existing file."
      },
      {
        "Order": 4,
        "subtitle": "Deleting a File",
        "description": "Create a script that deletes the output.txt file if it exists.",
        "purpose": "To learn how to check for file existence and delete files."
      },
      {
        "Order": 5,
        "subtitle": "Creating a Directory",
        "description": "Create a script that creates a directory named testDir.",
        "purpose": "To understand how to create directories programmatically."
      },
      {
        "Order": 6,
        "subtitle": "Listing Directory Contents",
        "description": "Create a script that lists the contents of the current directory and logs them to the console.",
        "purpose": "To explore how to list and log directory contents."
      },
      {
        "Order": 7,
        "subtitle": "Checking if a File Exists",
        "description": "Create a script that checks if example.txt exists and logs an appropriate message.",
        "purpose": "To learn how to verify the existence of a file and handle it accordingly."
      },
      {
        "Order": 8,
        "subtitle": "Copying a File",
        "description": "Create a script that copies example.txt to a new file named exampleCopy.txt.",
        "purpose": "To practice copying files within the file system."
      },
      {
        "Order": 9,
        "subtitle": "Watching a File for Changes",
        "description": "Create a script that watches example.txt for any changes and logs a message when a change is detected.",
        "purpose": "To understand how to monitor files for changes and handle those events."
      },
      {
        "Order": 10,
        "subtitle": "Reading and Writing JSON Files",
        "description": "Create a script that reads a JSON file named data.json, parses it, modifies a property, and writes it back to the file.",
        "purpose": "To learn how to handle JSON files, including reading, parsing, modifying, and writing data."
      }
    ]
  },
  {
    "chapter": "Process and OS",
    "purpose": "This chapter aims to teach the management and utilization of process and OS modules in Node.js projects.",
    "assignments": [
      {
        "Order": 1,
        "subtitle": "Read Environment Variables",
        "description": "Create a script that reads and logs environment variables from the process.env object.",
        "purpose": "To understand how to access environment variables in a Node.js application."
      },
      {
        "Order": 2,
        "subtitle": "Process Arguments",
        "description": "Write a script that logs the command-line arguments passed to it using process.argv.",
        "purpose": "To learn how to access and use command-line arguments in Node.js."
      },
      {
        "Order": 3,
        "subtitle": "Exit a Process",
        "description": "Create a script that exits with code 0 if an environment variable 'EXIT_NOW' is set to 'true'. Log the exit code.",
        "purpose": "To understand how to control process exit codes in Node.js."
      },
      {
        "Order": 4,
        "subtitle": "Process Signals",
        "description": "Write a script that listens for the SIGINT signal and logs a message before exiting.",
        "purpose": "To understand how to handle process signals in Node.js."
      },
      {
        "Order": 5,
        "subtitle": "Log Process Information",
        "description": "Create a script that logs current process information, including process ID, execution path, and memory usage.",
        "purpose": "To learn how to gather information about the current Node.js process."
      },
      {
        "Order": 6,
        "subtitle": "Read OS Information",
        "description": "Use the os module to log the platform, CPU architecture, and total memory of the operating system.",
        "purpose": "To learn how to retrieve basic information about the operating system using Node.js."
      },
      {
        "Order": 7,
        "subtitle": "Monitor Process Memory Usage",
        "description": "Write a script that logs the memory usage of the current Node.js process at regular intervals.",
        "purpose": "To understand how to monitor memory usage in a Node.js application."
      },
      {
        "Order": 8,
        "subtitle": "Process Standard Input/Output",
        "description": "Create a script that reads input from stdin, processes it, and writes the result to stdout.",
        "purpose": "To learn how to handle standard input and output streams in Node.js."
      },
      {
        "Order": 9,
        "subtitle": "Handle Process Exit Events",
        "description": "Write a script that listens for the 'exit' event on the process object and logs a message before the process exits.",
        "purpose": "To understand how to respond to process exit events in Node.js."
      },
      {
        "Order": 10,
        "subtitle": "Create a Simple OS Utility",
        "description": "Build a script that combines information from the process and os modules to log system uptime, current user information, and network interfaces.",
        "purpose": "To apply knowledge of process and OS modules in building a simple Node.js utility."
      }
    ]
  },
  {
    "chapter": "package.json Dependencies and Semver",
    "purpose": "This chapter aims to teach the management of dependencies and semantic versioning in Node.js projects using package.json.",
    "assignments": [
      {
        "Order": 1,
        "subtitle": "Create a package.json",
        "description": "Create a package.json file for a project with the name 'my-project' and version '1.0.0'.",
        "purpose": "To understand how to create and initialize a package.json file."
      },
      {
        "Order": 2,
        "subtitle": "Add Dependencies",
        "description": "Add a dependency to express version '^4.17.1' using CLI. Read the package.json file to verify the addition.",
        "purpose": "To learn how to add dependencies to a Node.js project."
      },
      {
        "Order": 3,
        "subtitle": "Add Development Dependencies",
        "description": "Add a development dependency to mocha version '^8.3.2' using CLI. Log the package.json file to verify the addition.",
        "purpose": "To understand how to add development dependencies to a Node.js project."
      },
      {
        "Order": 4,
        "subtitle": "Use Semver Ranges",
        "description": "Explain the difference between '^1.0.0', '~1.0.0', and '1.0.0' in package.json.",
        "purpose": "To learn the differences between various semantic versioning ranges."
      },
      {
        "Order": 5,
        "subtitle": "Update a Dependency",
        "description": "Update the express dependency to version '^4.18.0'. Log the package.json file to verify the update.",
        "purpose": "To understand how to update dependencies in a Node.js project."
      },
      {
        "Order": 6,
        "subtitle": "Remove a Dependency",
        "description": "Remove the mocha development dependency. Log the package.json file to verify the removal.",
        "purpose": "To learn how to remove dependencies from a Node.js project."
      },
      {
        "Order": 7,
        "subtitle": "Add Scripts",
        "description": "Add a script named 'start' that runs 'node index.js'. Log the package.json file to verify the addition.",
        "purpose": "To understand how to add scripts to a package.json file."
      },
      {
        "Order": 8,
        "subtitle": "Use Peer Dependencies",
        "description": "Add a peer dependency for react version '^17.0.1'. Log the package.json file to verify the addition.",
        "purpose": "To learn how to add peer dependencies to a Node.js project."
      },
      {
        "Order": 9,
        "subtitle": "Add Optional Dependencies",
        "description": "Add an optional dependency for fsevents version '^2.3.2'. Log the package.json file to verify the addition.",
        "purpose": "To understand how to add optional dependencies to a Node.js project."
      },
      {
        "Order": 10,
        "subtitle": "Handle Conflicting Versions",
        "description": "Explain how to handle conflicting versions of dependencies using resolutions in a package.json file.",
        "purpose": "To learn how to handle conflicting versions of dependencies in a Node.js project."
      }
    ]
  },
  {
    "chapter": "Child Processes",
    "purpose": "This chapter aims to teach how to create, configure, handle input/output, and communicate with child processes in Node.js.",
    "assignments": [
      {
        "Order": 1,
        "subtitle": "Create a Child Process with exec",
        "description": "Use the child_process module to execute a shell command using exec and log the output.",
        "purpose": "To understand how to create a child process using exec for executing shell commands."
      },
      {
        "Order": 2,
        "subtitle": "Create a Child Process with spawn",
        "description": "Use spawn to start a new process that runs a command-line utility (e.g., ls or dir) and log the output.",
        "purpose": "To learn how to create a child process using spawn and handle its output."
      },
      {
        "Order": 3,
        "subtitle": "Create a Child Process with fork",
        "description": "Create a child process using fork to run a separate Node.js script and log the messages exchanged.",
        "purpose": "To explore how to create a child process using fork for Node.js scripts and communicate with it."
      },
      {
        "Order": 4,
        "subtitle": "Handle Child Process Output",
        "description": "Write a script that spawns a process and logs the standard output and standard error streams separately.",
        "purpose": "To discover different ways to handle child process output and error streams."
      },
      {
        "Order": 5,
        "subtitle": "Pass Arguments to Child Process",
        "description": "Create a child process using spawn and pass command-line arguments. Log the arguments received by the child process.",
        "purpose": "To understand how to pass and handle command-line arguments in child processes."
      },
      {
        "Order": 6,
        "subtitle": "Set Environment Variables for Child Process",
        "description": "Spawn a child process with specific environment variables and log them from within the child process.",
        "purpose": "To learn how to set and access environment variables in child processes."
      },
      {
        "Order": 7,
        "subtitle": "Communicate with Child Process",
        "description": "Use fork to create a child process and set up a communication channel to send and receive messages.",
        "purpose": "To understand how to establish communication between parent and child processes using fork."
      },
      {
        "Order": 8,
        "subtitle": "Handle Child Process Exit",
        "description": "Spawn a child process and listen for its 'exit' event. Log the exit code and any errors.",
        "purpose": "To learn how to handle child process termination and retrieve its exit code."
      },
      {
        "Order": 9,
        "subtitle": "Pipe Streams Between Parent and Child Processes",
        "description": "Create a parent and child process where data is piped from the parent to the child and vice versa. Log the data at both ends.",
        "purpose": "To explore piping data between parent and child processes using streams."
      },
      {
        "Order": 10,
        "subtitle": "Implement a Worker Pool",
        "description": "Create a worker pool using child processes to perform parallel tasks and aggregate the results.",
        "purpose": "To apply knowledge of child processes in building a system that handles tasks concurrently."
      }
    ]
  },
  {
    "chapter": "Jest and Assertions",
    "purpose": "This chapter aims to teach the principles of assertions and how to use the Jest framework to write and run tests in Node.js projects.",
    "assignments": [
      {
        "Order": 1,
        "subtitle": "Introduction to Assertions",
        "description": "Write a script using Node.js's built-in assert module to demonstrate basic assertions for a simple function.",
        "purpose": "To understand the basic principles of assertions in Node.js."
      },
      {
        "Order": 2,
        "subtitle": "Run Tests with Node.js Assertions",
        "description": "Create a test script using the assert module to validate function outputs and run it directly using Node.js.",
        "purpose": "To learn how to run tests using Node.js assertions without any additional frameworks."
      },
      {
        "Order": 3,
        "subtitle": "Automate Test Execution with npm",
        "description": "Modify the package.json file to add a test script that uses Node.js to run the assertion-based tests.",
        "purpose": "To automate running tests using npm scripts and Node.js's built-in assert module."
      },
      {
        "Order": 4,
        "subtitle": "Advanced Assertions with Built-in Methods",
        "description": "Explore more advanced assertions using Node.js's assert module to test complex objects and error handling.",
        "purpose": "To enhance understanding of assertions by testing more complex scenarios using built-in methods."
      },
      {
        "Order": 5,
        "subtitle": "Configure npm Script for Advanced Assertions",
        "description": "Modify the package.json file to run the advanced assertion tests using an npm test script.",
        "purpose": "To configure the npm package to run more complex tests written with the assert module."
      },
      {
        "Order": 6,
        "subtitle": "Install Jest",
        "description": "Install the Jest test framework using npm and verify the installation by running a simple test.",
        "purpose": "To set up Jest as a test runner framework in a Node.js project."
      },
      {
        "Order": 7,
        "subtitle": "Write Basic Tests with Jest",
        "description": "Write a set of basic tests using Jest to validate the behavior of a simple function.",
        "purpose": "To learn how to write and structure tests using the Jest framework."
      },
      {
        "Order": 8,
        "subtitle": "Configure Jest in package.json",
        "description": "Modify your package.json file to use Jest as the default test runner and run tests using npm scripts.",
        "purpose": "To configure Jest in a Node.js project for standardized test execution via npm."
      },
      {
        "Order": 9,
        "subtitle": "Mock Functions with Jest",
        "description": "Create mock functions using Jest to isolate and test specific parts of your code.",
        "purpose": "To understand how to use Jest's mocking capabilities for more effective unit testing."
      },
      {
        "Order": 10,
        "subtitle": "Generate Test Coverage Reports with Jest",
        "description": "Use Jest's built-in coverage feature to generate a report and identify untested parts of your code.",
        "purpose": "To learn how to leverage Jest's coverage tools to improve test completeness and quality."
      }
    ]
  }]
}
  